Tekla Open API Reference for Tekla Structures 2025
LeaderLine Properties
The LeaderLine type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the attributes of the current object. Only attributes of the same type as the object are allowed.
 (Inherited from DrawingObject.)
ElbowPoints
 The leader line's elbow points (middle points).
EndPoint
 The end point of the leader line (set by the parent object).
LeaderLineType
 Gets the type of the leader line. For a list of the available leader line types see LeaderLine.LeaderLineTypes.
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
StartPoint
 The starting point of the leader line.
Top
See Also
Reference
LeaderLine Class
Tekla.Structures.Drawing Namespace